In [3]:
import pandas as pd

In [6]:
df = pd.read_csv("C:/data2.txt") 
df

   1990   1000
0  1994    560
1  1997    720
2  2001    202
3  2010    450
4  2017    322
5  2014    650

# Another Methods to read text file

In [8]:
data = pd.read_table("C:/Users/OLA/Documents/Data/data2.txt") # _table can also replace _csv
data

  1990, 1000
0  1994, 560
1  1997, 720
2  2001, 202
3  2010, 450
4  2017, 322
5  2014, 650

# To connect from the site dirrectly without downloading the file

In [43]:
pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     ------------------------------------ 112.2/112.2 kB 145.0 kB/s eta 0:00:00
Requirement already satisfied: six>=1.9 in c:\users\ola\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\ola\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Note: you may need to restart the kernel to use updated packages.

In [10]:
url = "https://en.wikipedia.org/wiki/2002_Winter_Olympics_medal_table"
list_of_df = pd.read_html(url)
medal_table = list_of_df[3]
medal_table.set_index('Rank')
medal_table.head()

  Rank          Nation  Gold  Silver  Bronze  Total
0    1          Norway    13       5       7     25
1    2         Germany    12      16       8     36
2    3  United States*    10      13      11     34
3    4          Canada     7       3       7     17
4    5          Russia     5       4       4     13

# Another Methods to check the attribute of all the table in the website

In [ ]:
medal_table = list_of_df

In [11]:
medal_table.describe()

            Gold     Silver     Bronze     Total
count  25.000000  25.000000  25.000000   25.0000
mean    6.400000   6.080000   6.240000   18.7200
std    15.761239  15.052464  15.311434   45.8862
min     0.000000   0.000000   0.000000    1.0000
25%     1.000000   1.000000   1.000000    3.0000
50%     3.000000   2.000000   2.000000    7.0000
75%     4.000000   4.000000   6.000000   13.0000
max    80.000000  76.000000  78.000000  234.0000

In [12]:
url = "https://en.wikipedia.org/wiki/2016_Summer_Olympics_medal_table"
list_of_df = pd.read_html(url)
medal_table = list_of_df[3]
medal_table.set_index('Rank')
medal_table.head()

  Rank            NOC  Gold  Silver  Bronze  Total
0    1  United States    46      37      38    121
1    2  Great Britain    27      23      17     67
2    3          China    26      18      26     70
3    4         Russia    19      17      20     56
4    5        Germany    17      10      15     42

# How to locate Nigeria details from the online data frame

In [14]:
medal_table[medal_table['NOC'] == 'Nigeria']

   Rank      NOC  Gold  Silver  Bronze  Total
82   78  Nigeria     0       0       1      1

In [15]:
medal_table[medal_table['NOC'] == 'Germany']

  Rank      NOC  Gold  Silver  Bronze  Total
4    5  Germany    17      10      15     42

In [19]:
def search_medal_rank(country_name):
    return medal_table[medal_table['NOC'] == country_name.title()]

In [22]:
name = input("Enter Country Name: ")
res_data = search_medal_rank(name)

print(res_data)

Enter Country Name: russia
  Rank     NOC  Gold  Silver  Bronze  Total
3    4  Russia    19      17      20     56

In [23]:
import numpy as np
import pandas as pd

In [28]:
j_data = pd.read_json('C:/Users/OLA/Documents/Data/movies.json')
j_data

,title,year,cast,genres
0,After Dark in Central Park,1900,[],[]
1,Boarding School Girls' Pajama Parade,1900,[],[]
2,Buffalo Bill's Wild West Parad,1900,[],[]
3,Caught,1900,[],[]
4,Clowns Spinning Hats,1900,[],[]
...,...,...,...,...
28790,Bumblebee,2018,"[Hailee Steinfeld, John Cena, Jorge Lendeborg ...","[Action, Adventure, Science Fiction]"
28791,Welcome to Marwen,2018,"[Steve Carell, Leslie Mann, Diane Kruger, Falk...","[Fantasy, Drama]"
28792,Holmes and Watson,2018,"[Will Ferrell, John C. Reilly, Rebecca Hall, R...","[Action, Mystery, Comedy]"
28793,On the Basis of Sex,2018,"[Felicity Jones, Armie Hammer, Justin Theroux,...","[Biography, Drama]"
28794,Destroyer,2018,"[Nicole Kidman, Tatiana Maslany, Sebastian Sta...","[Crime, Thriller]"

In [30]:
j_data.head()

                                  title  year cast genres
0            After Dark in Central Park  1900   []     []
1  Boarding School Girls' Pajama Parade  1900   []     []
2        Buffalo Bill's Wild West Parad  1900   []     []
3                                Caught  1900   []     []
4                  Clowns Spinning Hats  1900   []     []

In [33]:
# To look for the cast where the title is 'The Avengers'


res_title = j_data[j_data['title'] == 'The Avengers']
res_title

,title,year,cast,genres
13519,The Avengers,1950,"[Adele Mara, John Carroll]",[Adventure]
23778,The Avengers,1998,"[Ralph Fiennes, Uma Thurman, Sean Connery, Jim...",[Action]
27195,The Avengers,2012,"[Robert Downey, Jr., Chris Evans, Mark Ruffalo...",[Superhero]

In [34]:
# the cast

res_title = j_data[j_data['title'] == 'The Avengers']
res_title['cast']

13519                           [Adele Mara, John Carroll]
23778    [Ralph Fiennes, Uma Thurman, Sean Connery, Jim...
27195    [Robert Downey, Jr., Chris Evans, Mark Ruffalo...
Name: cast, dtype: object

# How to read the file extension .dta

In [37]:
house_dta = pd.read_stata("C:/Users/OLA/Documents/Data/house_starts.dta")
house_dta

       year  month  fixed_rate  starts   sold
0    1990.0    1.0        9.81  1551.0   45.0
1    1990.0    2.0        9.97  1437.0   50.0
2    1990.0    3.0       10.03  1289.0   58.0
3    1990.0    4.0       10.14  1248.0   52.0
4    1990.0    5.0       10.22  1212.0   50.0
..      ...    ...         ...     ...    ...
179  2004.0   12.0        5.90  2050.0   83.0
180  2005.0    1.0        5.90  2188.0   92.0
181  2005.0    2.0        5.90  2228.0  109.0
182  2005.0    3.0        5.98  1836.0  128.0
183  2005.0    4.0        6.09  2038.0  122.0

[184 rows x 5 columns]

In [42]:
pip install tabula.py

Requirement already satisfied: tabula.py in c:\users\ola\anaconda3\lib\site-packages (2.7.0)
Requirement already satisfied: numpy in c:\users\ola\anaconda3\lib\site-packages (from tabula.py) (1.21.5)
Requirement already satisfied: distro in c:\users\ola\anaconda3\lib\site-packages (from tabula.py) (1.8.0)
Requirement already satisfied: pandas>=0.25.3 in c:\users\ola\anaconda3\lib\site-packages (from tabula.py) (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\ola\anaconda3\lib\site-packages (from pandas>=0.25.3->tabula.py) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ola\anaconda3\lib\site-packages (from pandas>=0.25.3->tabula.py) (2022.1)
Requirement already satisfied: six>=1.5 in c:\users\ola\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas>=0.25.3->tabula.py) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
from tabula import read_pdf
housing_data = read_pdf("C:/Users/OLA/Documents/Data/Housing_data.pdf", pages=[2], pandas_options={'header':None})
housing_data

[      0       1      2     3
 0  15.2  386.71  17.10  18.9
 1  15.2  392.52  20.45  15.0
 2  15.2  396.90  13.27  18.9
 3  15.2  390.50  15.71  21.7]

# Introduction to beautiful Soup 4 and Web Page parsing

# 23/03/23

In [4]:
from bs4 import BeautifulSoup

with open("C:/Users/OLA/Documents/Data/test.html", "r") as fd:
    soup = BeautifulSoup(fd)
    print(soup)

<html><body><h1>Lorem ipsum dolor sit amet consectetuer adipiscing
elit</h1>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa
<strong>strong</strong>. Cum sociis natoque penatibus
et magnis dis parturient montes, nascetur ridiculus
mus. Donec quam felis, ultricies nec, pellentesque
eu, pretium quis, sem. Nulla consequat massa quis
enim. Donec pede justo, fringilla vel, aliquet nec,
vulputate eget, arcu. In enim justo, rhoncus ut,
imperdiet a, venenatis vitae, justo. Nullam dictum
felis eu pede <a class="external ext" href="#">link</a>
mollis pretium. Integer tincidunt. Cras dapibus.
Vivamus elementum semper nisi. Aenean vulputate
eleifend tellus. Aenean leo ligula, porttitor eu,
consequat vitae, eleifend ac, enim. Aliquam lorem ante,
dapibus in, viverra quis, feugiat a, tellus. Phasellus
viverra nulla ut metus varius laoreet. Quisque rutrum.
Aenean imperdiet. Etiam ultricies nisi vel augue.
Curabitur ullamcorper ultricies nisi.</p>
<h1>Lorem ipsum dolor sit amet consectetuer adipiscing
elit</h1>
<h2>Aenean commodo ligula eget dolor aenean massa</h2>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
<h2>Aenean commodo ligula eget dolor aenean massa</h2>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
<ul>
<li><a href="https://en.wikipedia.org/wiki/Entropy_(information_theory)">Information Entropy</a></li>
<li><a href="http://www.gutenberg.org/browse/scores/top">Top books in Gutenberg</a></li>
<li><a href="https://www.imdb.com/chart/top">Top 250 movies in IMDB</a></li>
</ul>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
<form action="#" method="post">
<fieldset>
<label for="name">Name:</label>
<input id="name" placeholder="Enter your
full name" type="text"/>
<label for="email">Email:</label>
<input id="email" placeholder="Enter
your email address" type="email"/>
<label for="message">Message:</label>
<textarea id="message" placeholder="What's on your
mind?"></textarea>
<input type="submit" value="Send message"/>
</fieldset>
</form>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
<table class="data">
<tr>
<th>Entry Header 1</th>
<th>Entry Header 2</th>
<th>Entry Header 3</th>
<th>Entry Header 4</th>
</tr>
<tr>
<td>Entry First Line 1</td>
<td>Entry First Line 2</td>
<td>Entry First Line 3</td>
<td>Entry First Line 4</td>
</tr>
<tr>
<td>Entry Line 1</td>
<td>Entry Line 2</td>
<td>Entry Line 3</td>
<td>Entry Line 4</td>
</tr>
<tr>
<td>Entry Last Line 1</td>
<td>Entry Last Line 2</td>
<td>Entry Last Line 3</td>
<td>Entry Last Line 4</td>
</tr>
</table>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
</body></html>

# To get all the paragraph in the Soup

In [6]:
print(soup.p)

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa
<strong>strong</strong>. Cum sociis natoque penatibus
et magnis dis parturient montes, nascetur ridiculus
mus. Donec quam felis, ultricies nec, pellentesque
eu, pretium quis, sem. Nulla consequat massa quis
enim. Donec pede justo, fringilla vel, aliquet nec,
vulputate eget, arcu. In enim justo, rhoncus ut,
imperdiet a, venenatis vitae, justo. Nullam dictum
felis eu pede <a class="external ext" href="#">link</a>
mollis pretium. Integer tincidunt. Cras dapibus.
Vivamus elementum semper nisi. Aenean vulputate
eleifend tellus. Aenean leo ligula, porttitor eu,
consequat vitae, eleifend ac, enim. Aliquam lorem ante,
dapibus in, viverra quis, feugiat a, tellus. Phasellus
viverra nulla ut metus varius laoreet. Quisque rutrum.
Aenean imperdiet. Etiam ultricies nisi vel augue.
Curabitur ullamcorper ultricies nisi.</p>

# To get all the paragraph

In [9]:
all_p = soup.find_all('p')
for p in all_p:
    print(p, "\n")

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa
<strong>strong</strong>. Cum sociis natoque penatibus
et magnis dis parturient montes, nascetur ridiculus
mus. Donec quam felis, ultricies nec, pellentesque
eu, pretium quis, sem. Nulla consequat massa quis
enim. Donec pede justo, fringilla vel, aliquet nec,
vulputate eget, arcu. In enim justo, rhoncus ut,
imperdiet a, venenatis vitae, justo. Nullam dictum
felis eu pede <a class="external ext" href="#">link</a>
mollis pretium. Integer tincidunt. Cras dapibus.
Vivamus elementum semper nisi. Aenean vulputate
eleifend tellus. Aenean leo ligula, porttitor eu,
consequat vitae, eleifend ac, enim. Aliquam lorem ante,
dapibus in, viverra quis, feugiat a, tellus. Phasellus
viverra nulla ut metus varius laoreet. Quisque rutrum.
Aenean imperdiet. Etiam ultricies nisi vel augue.
Curabitur ullamcorper ultricies nisi.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

In [11]:
print(len(all_p)) # to check the lenght of p

6

In [13]:
# to print al the children of the first paragraph

for child in all_p[0].children:
    print(child, '\n')

Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa


<strong>strong</strong>

. Cum sociis natoque penatibus
et magnis dis parturient montes, nascetur ridiculus
mus. Donec quam felis, ultricies nec, pellentesque
eu, pretium quis, sem. Nulla consequat massa quis
enim. Donec pede justo, fringilla vel, aliquet nec,
vulputate eget, arcu. In enim justo, rhoncus ut,
imperdiet a, venenatis vitae, justo. Nullam dictum
felis eu pede

<a class="external ext" href="#">link</a>


mollis pretium. Integer tincidunt. Cras dapibus.
Vivamus elementum semper nisi. Aenean vulputate
eleifend tellus. Aenean leo ligula, porttitor eu,
consequat vitae, eleifend ac, enim. Aliquam lorem ante,
dapibus in, viverra quis, feugiat a, tellus. Phasellus
viverra nulla ut metus varius laoreet. Quisque rutrum.
Aenean imperdiet. Etiam ultricies nisi vel augue.
Curabitur ullamcorper ultricies nisi.

In [14]:
table = soup.table

for child in table.children:
    print(child)

<tr>
<th>Entry Header 1</th>
<th>Entry Header 2</th>
<th>Entry Header 3</th>
<th>Entry Header 4</th>
</tr>


<tr>
<td>Entry First Line 1</td>
<td>Entry First Line 2</td>
<td>Entry First Line 3</td>
<td>Entry First Line 4</td>
</tr>


<tr>
<td>Entry Line 1</td>
<td>Entry Line 2</td>
<td>Entry Line 3</td>
<td>Entry Line 4</td>
</tr>


<tr>
<td>Entry Last Line 1</td>
<td>Entry Last Line 2</td>
<td>Entry Last Line 3</td>
<td>Entry Last Line 4</td>
</tr>

In [15]:
# To get the text of the web without the body code

all_th = soup.find_all('th')

for col in all_th:
    print(col.get_text())

Entry Header 1
Entry Header 2
Entry Header 3
Entry Header 4

In [21]:
col_header = [th.getText() for th in soup.findAll('th')]
col_header

['Entry Header 1', 'Entry Header 2', 'Entry Header 3', 'Entry Header 4']

In [22]:
import pandas as pd

In [27]:
url = "https://en.wikipedia.org/wiki/2002_Winter_Olympics_medal_table"
list_of_df = pd.read_html(url)
medal_table = list_of_df[3]
medal_table.set_index('Rank', inplace=True)
medal_table

                                  Nation  Gold  Silver  Bronze  Total
Rank
1                                 Norway    13       5       7     25
2                                Germany    12      16       8     36
3                         United States*    10      13      11     34
4                                 Canada     7       3       7     17
5                                 Russia     5       4       4     13
6                                 France     4       5       2     11
7                                  Italy     4       4       5     13
8                                Finland     4       2       1      7
9                            Netherlands     3       5       0      8
10                               Austria     3       4      10     17
11                           Switzerland     3       2       6     11
12                               Croatia     3       1       0      4
13                                 China     2       2       4      8
14                           South Korea     2       2       0      4
15                             Australia     2       0       0      2
16                        Czech Republic     1       2       0      3
17                               Estonia     1       1       1      3
18                         Great Britain     1       0       1      2
19                                Sweden     0       2       5      7
20                              Bulgaria     0       1       2      3
21                                 Japan     0       1       1      2
21                                Poland     0       1       1      2
23                               Belarus     0       0       1      1
23                              Slovenia     0       0       1      1
Totals (24 entries)  Totals (24 entries)    80      76      78    234

In [25]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\ola\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\ola\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [28]:
url = "https://en.wikipedia.org/wiki/2016_Summer_Olympics_medal_table"
list_of_df = pd.read_html(url)
medal_table = list_of_df[3]
medal_table.set_index('Rank', inplace=True)
medal_table

                                      NOC  Gold  Silver  Bronze  Total
Rank
1                           United States    46      37      38    121
2                           Great Britain    27      23      17     67
3                                   China    26      18      26     70
4                                  Russia    19      17      20     56
5                                 Germany    17      10      15     42
...                                   ...   ...     ...     ...    ...
78                                Nigeria     0       0       1      1
78                               Portugal     0       0       1      1
78                    Trinidad and Tobago     0       0       1      1
78                   United Arab Emirates     0       0       1      1
Totals (86 entries)   Totals (86 entries)   306     307     359    972

[87 rows x 5 columns]

# To save my finished work on my file after parsing

In [31]:
writer = pd.ExcelWriter('C:/Users/OLA/Documents/Data/test_output.xlsx')
medal_table.to_excel(writer, 'sheet1')
writer.save()

# 28/03/2023

In [ ]:
# DDL = Data defination language : this represent an object in the program
    # sub options under DDL=> Creat, ALter, Drop (to remove), Rename, Truncate(delete all records but cant be recover or undo the command)


# DML = Data Manipulation language

    # sub options under DML => Insert, Update, Delete, Merge, Select
    
    
# DCL = Data Control Language

    #  Grant, Revoke, Deny

# TCL = Transaction Control Language 
    # ACID
    #commit
    #rollback
    #savepoint

In [1]:
import sqlite3

with sqlite3.connect("ds210322.db") as con:
    Cursor = con.cursor()
    stmt = """CREATE TABLE Student(stud_id integer primary key autoincrement, 
                                    name varchar(255),
                                    city varchar(255),
                                    pin int)"""
    con.execute(stmt)

con

OperationalError: table Student already exists

In [3]:
import sqlite3

with sqlite3.connect("ds210322.db") as con:
    cursor = con.cursor()
    stmt = """
        insert into student (name, city, pin) values('Ade', 'Lagos', '1212')
    """
    cursor.execute(stmt)

In [1]:
# second method

import sqlite3

conn = sqlite3.connect("ds210322.db")
cursor = conn.cursor()
stmt = """
    insert into student (name, city, pin)
    values('Biodun', 'Abuja', '1111')
"""
cursor.execute(stmt)
conn.commit()
cursor.close()
conn.close()

In [2]:
# to insert multiple records to the database
import sqlite3

with sqlite3.connect("ds210322.db") as con:
    cursor = con.cursor()
    record = (('Chika', 'Aba', '6667'),
             ('Chioma', 'Edo', '2122'),
             ('Garba', 'Kano', '988'))
    
    stmt ="""
        insert into student (name, city, pin) values(?, ?, ?)
    """
    cursor.executemany(stmt, record)

In [ ]:
import sqlite3

with sqlite3.connect("ds210322.db") as con:
    cursor = con.cursor()
    stmt = """

# 30/03/23

DDL: Data Definition Language DML: Data Manipulation Language DCL: Data Control Language TCL: Transaction Control Language

DDL (Data Definition Language) - used to define the structure of the database schema, including creating, Rename, Truncate (to remove all record in table), altering, and dropping database objects such as tables, indexes, views, etc.(anytime you use a DDL language, it is auto done and it is permanent.)

DML (Data Manipulation Language) - used to manipulate or change the data within the database, including inserting, updating, deleting, Merge and selecting data from tables.

DCL (Data Control Language) - used to control access to the database, including granting or revoking privileges to users and roles. (Grant, revoke, deny*[only for msql server])

TCL (Transaction Control Language) - used to manage transactions within the database, including committing or rolling back transactions and setting transaction isolation levels. properties of transaction: ACID

Commit rollback savepoint

In [4]:
pip install pyspark

Collecting pysparkNote: you may need to restart the kernel to use updated packages.

  Downloading pyspark-3.3.2.tar.gz (281.4 MB)
     ------------------------------------- 281.4/281.4 MB 19.9 kB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Collecting py4j==0.10.9.5
  Downloading py4j-0.10.9.5-py2.py3-none-any.whl (199 kB)
     ------------------------------------ 199.7/199.7 kB 404.0 kB/s eta 0:00:00
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py): started
  Building wheel for pyspark (setup.py): still running...
  Building wheel for pyspark (setup.py): still running...
  Building wheel for pyspark (setup.py): finished with status 'done'
  Created wheel for pyspark: filename=pyspark-3.3.2-py2.py3-none-any.whl size=281824023 sha256=299f8e91bca0f07dde6fbdaa7cd6131d10c05f097568d4429b6b5cc7a837022c
  Stored in directory: c:\users\ola\appdata\local\pip\cache\wheels\6c\e3\9b\0525ce8a69478916513509d43693511463c6468db0de237c86
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.5 pyspark-3.3.2

In [2]:
pip install findspark

Requirement already satisfied: findspark in c:\users\ola\anaconda3\lib\site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import findspark
findspark.init()

In [2]:
from pyspark import SparkContext
from pyspark.sql import SQLContext
import os

os.environ["JAVA_HOME"] = 'C:/Program Files/Java/jdk1.8.0_341'

sc = SparkContext()
sqlc = SQLContext(sc)

C:\Users\OLA\Anaconda3\lib\site-packages\pyspark\sql\context.py:112: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

In [3]:
import os 
import sys

os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

data = [('java', 5500),
       ('python', 3500),
       ('django', 3500),
       ('c#', 4500),
       ('React', 3000),
       ('Web Design', 3000)]
df = sqlc.createDataFrame(data)
df.show()

+----------+----+
|        _1|  _2|
+----------+----+
|      java|5500|
|    python|3500|
|    django|3500|
|        c#|4500|
|     React|3000|
|Web Design|3000|
+----------+----+

# ds18/04/23

# Into to Big Data

In [ ]:
# intoduction to Big data
# HDFS = HAdoop
# tals about HDFS Architecture
#manipulating data with htfs


# check all these website in the new enviroment with any browser
#http://localhost:9870/dfshealth.html
# http://localhost:9864/

#to open the function (type start-all)
#to know all the command to work with in the new window( type hdfs and enter)
# to know all the root command in the new window (type hdfs dfs -ls /)

#let make a dirrectory
#type(hdfs dfs -mkdir /data)

#To create text file(type hdfs dfs -touchz /data/myfile.txt)

# to write the file we have created ( hdfs dfs -appendToFile /data/myfile.txt "Hello, helen..")

#-cp to copy
#-get / -copyToLocal
#-du

# DS27/04/2023

# We want to create schema

# Schema means:  Creating a table from scrash to build a database 

# Also means: creating a table from an existing database

In [1]:
import os
import sys

os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

In [2]:
from pyspark import SparkContext
sc = SparkContext()
from pyspark.sql import SQLContext
sqlc = SQLContext(sc)

C:\Users\OLA\Anaconda3\lib\site-packages\pyspark\sql\context.py:112: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

In [19]:
from pyspark.sql import *

table = Row("Name", "Age")

In [20]:
row1 = table("Ankit", 23)
row2 = table("Tyler", 26)
row3 = table("Preity", 36)

In [21]:
na_list = [row1, row2, row3]
df_na = sqlc.createDataFrame(na_list)
type(df_na)

pyspark.sql.dataframe.DataFrame

In [22]:
df_na.show()

+------+---+
|  Name|Age|
+------+---+
| Ankit| 23|
| Tyler| 26|
|Preity| 36|
+------+---+

# From Existing database

In [6]:
data = [("Ankit", 23), ("Tyler", 26), ("Preity", 36)]
data_rdd = sc.parallelize(data)
type(data_rdd)

pyspark.rdd.RDD

# Let create dataframe from the above

In [7]:
data_df = sqlc.createDataFrame(data_rdd)
data_df.show()

+------+---+
|    _1| _2|
+------+---+
| Ankit| 23|
| Tyler| 26|
|Preity| 36|
+------+---+

In [ ]:
# first method to read from scrash with format

In [8]:
df = sqlc.read.format('com.databricks.spark.csv'). \
options(header='true', inferschema='true').\
load('C:/Users/OLA/Documents/Data/1000_Companies.csv')
type(df)

pyspark.sql.dataframe.DataFrame

In [9]:
df.show(5)

+---------+--------------+---------------+----------+---------+
|R&D Spend|Administration|Marketing Spend|     State|   Profit|
+---------+--------------+---------------+----------+---------+
| 165349.2|      136897.8|       471784.1|  New York|192261.83|
| 162597.7|     151377.59|      443898.53|California|191792.06|
|153441.51|     101145.55|      407934.54|   Florida|191050.39|
|144372.41|     118671.85|      383199.62|  New York|182901.99|
|142107.34|      91391.77|      366168.42|   Florida|166187.94|
+---------+--------------+---------------+----------+---------+
only showing top 5 rows

In [10]:
# Normal method to read csv file

df = sqlc.read.csv('C:/Users/OLA/Documents/Data/1000_Companies.csv', header=True)

In [11]:
df.show(5)

+---------+--------------+---------------+----------+---------+
|R&D Spend|Administration|Marketing Spend|     State|   Profit|
+---------+--------------+---------------+----------+---------+
| 165349.2|      136897.8|       471784.1|  New York|192261.83|
| 162597.7|     151377.59|      443898.53|California|191792.06|
|153441.51|     101145.55|      407934.54|   Florida|191050.39|
|144372.41|     118671.85|      383199.62|  New York|182901.99|
|142107.34|      91391.77|      366168.42|   Florida|166187.94|
+---------+--------------+---------------+----------+---------+
only showing top 5 rows

In [12]:
df.printSchema()

root
 |-- R&D Spend: string (nullable = true)
 |-- Administration: string (nullable = true)
 |-- Marketing Spend: string (nullable = true)
 |-- State: string (nullable = true)
 |-- Profit: string (nullable = true)

In [13]:
df.count()

1000

In [ ]:
# lenght of columns

In [14]:
len(df.columns)

5

In [15]:
df.describe().show()

+-------+------------------+------------------+-----------------+----------+-----------------+
|summary|         R&D Spend|    Administration|  Marketing Spend|     State|           Profit|
+-------+------------------+------------------+-----------------+----------+-----------------+
|  count|              1000|              1000|             1000|      1000|             1000|
|   mean|        81668.9272|122963.89761169997|226205.0584188303|      null|119546.1646556102|
| stddev|46537.567891489154|12613.927534630999|91578.39354210423|      null|42888.63384847687|
|    min|                 0|         101145.55|                0|California|      100404.0021|
|    max|             99774|          99814.71|      99267.11183|  New York|         99937.59|
+-------+------------------+------------------+-----------------+----------+-----------------+

In [16]:
# summary of specific colunm that you want

df.describe(['R&D Spend', 'Administration']).show()

+-------+------------------+------------------+
|summary|         R&D Spend|    Administration|
+-------+------------------+------------------+
|  count|              1000|              1000|
|   mean|        81668.9272|122963.89761169997|
| stddev|46537.567891489154|12613.927534630999|
|    min|                 0|         101145.55|
|    max|             99774|          99814.71|
+-------+------------------+------------------+

In [27]:
# convert data frame to pandas environment

df.toPandas()

     R&D Spend Administration Marketing Spend       State       Profit
0     165349.2       136897.8        471784.1    New York    192261.83
1     162597.7      151377.59       443898.53  California    191792.06
2    153441.51      101145.55       407934.54     Florida    191050.39
3    144372.41      118671.85       383199.62    New York    182901.99
4    142107.34       91391.77       366168.42     Florida    166187.94
..         ...            ...             ...         ...          ...
995      54135     118451.999     173232.6695  California  95279.96251
996     134970      130390.08     329204.0228  California  164336.6055
997  100275.47      241926.31       227142.82  California    413956.48
998  128456.23      321652.14       281692.32  California    333962.19
999  161181.72      270939.86       295442.17    New York    476485.43

[1000 rows x 5 columns]

# DS020523

In [18]:
# checking the missing column

df.where(df['R&D Spend'].isNull()).show()

+---------+--------------+---------------+-----+------+
|R&D Spend|Administration|Marketing Spend|State|Profit|
+---------+--------------+---------------+-----+------+
+---------+--------------+---------------+-----+------+

In [23]:
df1 = df['Administration','Marketing Spend']
df1.where(df['R&D Spend'].isNull()).show()

+--------------+---------------+
|Administration|Marketing Spend|
+--------------+---------------+
+--------------+---------------+

In [25]:
dff = sqlc.read.csv('C:/Users/OLA/Documents/Data/Iris.csv', header=True)

In [26]:
dff.show(5)

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  1|          5.1|         3.5|          1.4|         0.2|Iris-setosa|
|  2|          4.9|         3.0|          1.4|         0.2|Iris-setosa|
|  3|          4.7|         3.2|          1.3|         0.2|Iris-setosa|
|  4|          4.6|         3.1|          1.5|         0.2|Iris-setosa|
|  5|          5.0|         3.6|          1.4|         0.2|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+
only showing top 5 rows

In [27]:
# How do we attend to missing column: Answer( Either by removing the column(dropna()) or updating the column)


dff_null = sqlc.read.csv('C:/Users/OLA/Documents/Data/Iris_null.csv', header=True)
dff_null.show(5)

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  1|          5.1|         3.5|          1.4|         0.2|Iris-setosa|
|  2|          4.9|           3|          1.4|         0.2|Iris-setosa|
|  3|          4.7|         3.2|          1.3|         0.2|Iris-setosa|
|  4|         null|         3.1|         null|         0.2|Iris-setosa|
|  5|            5|         3.6|          1.4|         0.2|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+
only showing top 5 rows

In [34]:
dff_null.where(dff_null['SepallengthCm'].isNull())
dff_null.show()

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  1|          5.1|         3.5|          1.4|         0.2|Iris-setosa|
|  2|          4.9|           3|          1.4|         0.2|Iris-setosa|
|  3|          4.7|         3.2|          1.3|         0.2|Iris-setosa|
|  4|         null|         3.1|         null|         0.2|Iris-setosa|
|  5|            5|         3.6|          1.4|         0.2|Iris-setosa|
|  6|          5.4|         3.9|          1.7|         0.4|Iris-setosa|
|  7|          4.6|         3.4|          1.4|         0.3|Iris-setosa|
|  8|            5|         3.4|          1.5|         0.2|Iris-setosa|
|  9|          4.4|         2.9|          1.4|         0.2|Iris-setosa|
| 10|          4.9|         3.1|          1.5|         0.1|Iris-setosa|
| 11|          5.4|         3.7|          1.5|         0.2|Iris-setosa|
| 12|          4.8|         3.4|          1.6|         0.2|Iris-setosa|
| 13|         null|           3|         null|         0.1|Iris-setosa|
| 14|          4.3|           3|          1.1|         0.1|Iris-setosa|
| 15|          5.8|           4|          1.2|         0.2|Iris-setosa|
| 16|          5.7|         4.4|          1.5|         0.4|Iris-setosa|
| 17|          5.4|         3.9|          1.3|         0.4|Iris-setosa|
| 18|          5.1|         3.5|          1.4|         0.3|Iris-setosa|
| 19|          5.7|         3.8|          1.7|         0.3|Iris-setosa|
| 20|          5.1|         3.8|          1.5|         0.3|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+
only showing top 20 rows

In [37]:
dff_null.select('SepalLengthCm').dropna().count()

148

In [38]:
dff_null.where(dff_null['Id'].isNull()).show()

+---+-------------+------------+-------------+------------+-------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|Species|
+---+-------------+------------+-------------+------------+-------+
+---+-------------+------------+-------------+------------+-------+

In [39]:
dff_null.where(dff_null['SepallengthCm'].isNull()).show()

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  4|         null|         3.1|         null|         0.2|Iris-setosa|
| 13|         null|           3|         null|         0.1|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+

# To fill or update the empty columns of the dataframe

In [42]:
# First Methods

y = dff_null.select('SepallengthCm').fillna('1')

In [44]:
from pyspark.sql.functions import isnan, when, count, col

y.select([count(when(isnan(i) | col(i).isNull(), i)).alias(i) for i in
y.columns]).show()

+-------------+
|SepallengthCm|
+-------------+
|            0|
+-------------+

In [49]:
# Second Method

z = dff_null.na.fill({'SepallengthCm': 8.0, 'PetalLengthCm': 0.10})

In [50]:
from pyspark.sql.functions import isnan, when, count, col

z.select([count(when(isnan(i) | col(i).isNull(), i)).alias(i) for i in
z.columns]).show()

+---+-------------+------------+-------------+------------+-------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|Species|
+---+-------------+------------+-------------+------------+-------+
|  0|            0|           0|            0|           0|      0|
+---+-------------+------------+-------------+------------+-------+

In [51]:
z.show(20)

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  1|          5.1|         3.5|          1.4|         0.2|Iris-setosa|
|  2|          4.9|           3|          1.4|         0.2|Iris-setosa|
|  3|          4.7|         3.2|          1.3|         0.2|Iris-setosa|
|  4|          8.0|         3.1|          0.1|         0.2|Iris-setosa|
|  5|            5|         3.6|          1.4|         0.2|Iris-setosa|
|  6|          5.4|         3.9|          1.7|         0.4|Iris-setosa|
|  7|          4.6|         3.4|          1.4|         0.3|Iris-setosa|
|  8|            5|         3.4|          1.5|         0.2|Iris-setosa|
|  9|          4.4|         2.9|          1.4|         0.2|Iris-setosa|
| 10|          4.9|         3.1|          1.5|         0.1|Iris-setosa|
| 11|          5.4|         3.7|          1.5|         0.2|Iris-setosa|
| 12|          4.8|         3.4|          1.6|         0.2|Iris-setosa|
| 13|          8.0|           3|          0.1|         0.1|Iris-setosa|
| 14|          4.3|           3|          1.1|         0.1|Iris-setosa|
| 15|          5.8|           4|          1.2|         0.2|Iris-setosa|
| 16|          5.7|         4.4|          1.5|         0.4|Iris-setosa|
| 17|          5.4|         3.9|          1.3|         0.4|Iris-setosa|
| 18|          5.1|         3.5|          1.4|         0.3|Iris-setosa|
| 19|          5.7|         3.8|          1.7|         0.3|Iris-setosa|
| 20|          5.1|         3.8|          1.5|         0.3|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+
only showing top 20 rows

# Correlation